yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8s903k3.h
#define TIM5_SR2_CC1OF           TIM5_SR2_bit.CC1OF
#define TIM5_SR2_CC2OF           TIM5_SR2_bit.CC2OF
#define TIM5_SR2_CC3OF           TIM5_SR2_bit.CC3OF

#define TIM5_EGR_UG              TIM5_EGR_bit.UG
#define TIM5_EGR_CC1G            TIM5_EGR_bit.CC1G
#define TIM5_EGR_CC2G            TIM5_EGR_bit.CC2G
#define TIM5_EGR_CC3G            TIM5_EGR_bit.CC3G
#define TIM5_EGR_TG              TIM5_EGR_bit.TG

#define TIM5_CCMR1_CC1S          TIM5_CCMR1_bit.CC1S
#define TIM5_CCMR1_OC1PE         TIM5_CCMR1_bit.OC1PE
#define TIM5_CCMR1_OC1M          TIM5_CCMR1_bit.OC1M

#define TIM5_CCMR2_CC2S          TIM5_CCMR2_bit.CC2S
#define TIM5_CCMR2_OC2PE         TIM5_CCMR2_bit.OC2PE
#define TIM5_CCMR2_OC2M          TIM5_CCMR2_bit.OC2M

#define TIM5_CCMR3_CC3S          TIM5_CCMR3_bit.CC3S
#define TIM5_CCMR3_OC3PE         TIM5_CCMR3_bit.OC3PE
#define TIM5_CCMR3_OC3M          TIM5_CCMR3_bit.OC3M

#define TIM5_CCER1_CC1E          TIM5_CCER1_bit.CC1E
#define TIM5_CCER1_CC1P          TIM5_CCER1_bit.CC1P
#define TIM5_CCER1_CC2E          TIM5_CCER1_bit.CC2E
#define TIM5_CCER1_CC2P          TIM5_CCER1_bit.CC2P

#define TIM5_CCER2_CC3E          TIM5_CCER2_bit.CC3E
#define TIM5_CCER2_CC3P          TIM5_CCER2_bit.CC3P

#define TIM5_PSCR_PSC            TIM5_PSCR_bit.PSC

#endif

/*-------------------------------------------------------------------------
 *      TIM5 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM5_CR1_CEN        0x01
#define MASK_TIM5_CR1_UDIS       0x02
#define MASK_TIM5_CR1_URS        0x04
#define MASK_TIM5_CR1_OPM        0x08
#define MASK_TIM5_CR1_ARPE       0x80

#define MASK_TIM5_CR2_CCPC       0x01
#define MASK_TIM5_CR2_COMS       0x04
#define MASK_TIM5_CR2_MMS        0x70

#define MASK_TIM5_SMCR_SMS       0x07
#define MASK_TIM5_SMCR_TS        0x70
#define MASK_TIM5_SMCR_MSM       0x80

#define MASK_TIM5_IER_UIE        0x01
#define MASK_TIM5_IER_CC1IE      0x02
#define MASK_TIM5_IER_CC2IE      0x04
#define MASK_TIM5_IER_CC3IE      0x08
#define MASK_TIM5_IER_TIE        0x40

#define MASK_TIM5_SR1_UIF        0x01
#define MASK_TIM5_SR1_CC1IF      0x02
#define MASK_TIM5_SR1_CC2IF      0x04
#define MASK_TIM5_SR1_CC3IF      0x08
#define MASK_TIM5_SR1_TIF        0x40

#define MASK_TIM5_SR2_CC1OF      0x02
#define MASK_TIM5_SR2_CC2OF      0x04
#define MASK_TIM5_SR2_CC3OF      0x08

#define MASK_TIM5_EGR_UG         0x01
#define MASK_TIM5_EGR_CC1G       0x02
#define MASK_TIM5_EGR_CC2G       0x04
#define MASK_TIM5_EGR_CC3G       0x08
#define MASK_TIM5_EGR_TG         0x40

#define MASK_TIM5_CCMR1_CC1S     0x03
#define MASK_TIM5_CCMR1_OC1PE    0x08
#define MASK_TIM5_CCMR1_OC1M     0x70

#define MASK_TIM5_CCMR2_CC2S     0x03
#define MASK_TIM5_CCMR2_OC2PE    0x08
#define MASK_TIM5_CCMR2_OC2M     0x70

#define MASK_TIM5_CCMR3_CC3S     0x03
#define MASK_TIM5_CCMR3_OC3PE    0x08
#define MASK_TIM5_CCMR3_OC3M     0x70

#define MASK_TIM5_CCER1_CC1E     0x01
#define MASK_TIM5_CCER1_CC1P     0x02
#define MASK_TIM5_CCER1_CC2E     0x10
#define MASK_TIM5_CCER1_CC2P     0x20

#define MASK_TIM5_CCER2_CC3E     0x01
#define MASK_TIM5_CCER2_CC3P     0x02

#define MASK_TIM5_PSCR_PSC       0x0F


/*-------------------------------------------------------------------------
 *      TIM6 register definitions
 *-----------------------------------------------------------------------*/
/* TIM6 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char             : 3;
  unsigned char ARPE        : 1;
} __BITS_TIM6_CR1;
#endif
__IO_REG8_BIT(TIM6_CR1,    0x5340, __READ_WRITE, __BITS_TIM6_CR1);

/* TIM6 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char MMS         : 3;
} __BITS_TIM6_CR2;
#endif
__IO_REG8_BIT(TIM6_CR2,    0x5341, __READ_WRITE, __BITS_TIM6_CR2);

/* TIM6 slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM6_SMCR;
#endif
__IO_REG8_BIT(TIM6_SMCR,   0x5342, __READ_WRITE, __BITS_TIM6_SMCR);

/* TIM6 interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char             : 5;
  unsigned char TIE         : 1;
} __BITS_TIM6_IER;
#endif
__IO_REG8_BIT(TIM6_IER,    0x5343, __READ_WRITE, __BITS_TIM6_IER);

/* TIM6 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char             : 5;
  unsigned char TIF         : 1;
} __BITS_TIM6_SR;
#endif
__IO_REG8_BIT(TIM6_SR,     0x5344, __READ_WRITE, __BITS_TIM6_SR);

/* TIM6 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char             : 5;
  unsigned char TG          : 1;
} __BITS_TIM6_EGR;
#endif
__IO_REG8_BIT(TIM6_EGR,    0x5345, __WRITE, __BITS_TIM6_EGR);

/* TIM6 counter */
__IO_REG8    (TIM6_CNTR,   0x5346, __READ_WRITE);
/* TIM6 prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_TIM6_PSCR;
#endif
__IO_REG8_BIT(TIM6_PSCR,   0x5347, __READ_WRITE, __BITS_TIM6_PSCR);

/* TIM6 auto-reload register */
__IO_REG8    (TIM6_ARR,    0x5348, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      TIM6 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM6_CR1_CEN             TIM6_CR1_bit.CEN
#define TIM6_CR1_UDIS            TIM6_CR1_bit.UDIS
#define TIM6_CR1_URS             TIM6_CR1_bit.URS
#define TIM6_CR1_OPM             TIM6_CR1_bit.OPM
#define TIM6_CR1_ARPE            TIM6_CR1_bit.ARPE

#define TIM6_CR2_MMS             TIM6_CR2_bit.MMS

#define TIM6_SMCR_SMS            TIM6_SMCR_bit.SMS
#define TIM6_SMCR_TS             TIM6_SMCR_bit.TS
#define TIM6_SMCR_MSM            TIM6_SMCR_bit.MSM

#define TIM6_IER_UIE             TIM6_IER_bit.UIE
#define TIM6_IER_TIE             TIM6_IER_bit.TIE

